import './designing.css';

const Designing=()=>{
    return(
        <div className='designing'>
            <div className='d1'>
                <h3>طراحی صنعتی </h3>
             به توسعه محصولات تولیدی مانند لوازم خانگی و یا خودرو می پردازد.
             در کل به تغییر شکل یک محصول طراحی صنعتی می گویند.
              به عنوان مثال با تغییراتی در یک میز یا صندلی زیبایی و راحتی به آن اضافه می کنیم. کامپیوتر ها و لپتاپ ها اصلی ترین ابزار برای طراحی صنعتی هستند.
              که می توان با نصب نرم افزار های پیشرفته ایده های جدید را طراحی و یا ایده های قبلی را تغییر داد.
              طراحی 3 بعدی و نقشه کشی صنعتی 2 بخش عمده در طراحی صنعتی میباشند
            </div>
            <div className='d2'>
            <h3>مهندسی معکوس  </h3>
             یک فرایند حل مسئله است که به جای آنکه از سوال آغاز شود، از پاسخ موجود آغاز می‌شود.
            <p>
            در اینجا برخی از این کاربردها را مرور می‌کنیم:

زمانی که یک قطعه‌ی صنعتی، مثلاً یک گیربکس یا موتور، به خوبی کار می‌کند و عملکرد بالایی دارد ممکن است یک شرکت تولیدی تصمیم بگیرد به جای طراحی از نقطه‌ی صفر، آن قطعه را به اجزای کوچک‌تر تفکیک کرده و هر جزء را تحلیل و مدلسازی کند تا به توانایی بازتولید آن قطعه دست پیدا کند.
وقتی دندان پزشکان بر اساس شکل یک دندان قالب می‌سازند و می‌کوشند مدلی مشابه آن را تولید کنند.
وقتی یک برنامه نویس، به جای طراحی سیستم و برنامه نویسی از نقطه صفر، یک برنامه یا سیستم موفق را مورد تجزیه و تحلیل قرار می‌دهد و سعی می‌کند اجزای آن را بازتولید کند.
وقتی ارتش یا سازمان‌های نظامی یک کشور، محصولات نظامی کشور دیگر را به دست می‌آورند و می‌کوشند با مهندسی معکوس به دانش و فن آوری آن کشور دست یابند یا لااقل توان علمی و فنی سازنده را ارزیابی کنند.
تلاش برای استخراج کدهای سطح بالای یک برنامه نرم افزاری بر اساس کدهای اسمبلی محصول نهایی
            </p>
            </div>
        </div>
    )
}

export default Designing;